Table of Contents
 Class RebarPolyLine3D
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a polyline in 3D space.
public class RebarPolyLine3D : OpenObject
Inheritance
object
OpenObject
RebarPolyLine3D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 RebarPolyLine3D()
Constructor
public RebarPolyLine3D()
Properties
 Segments
Gets segments of RebarPolyLine3D.
public List<RebarSegment3DBase> Segments { get; set; }
Property Value
List<RebarSegment3DBase>
 StartPoint
Gets or sets the point where the RebarPolyLine3D begins.
public RebarPoint3D StartPoint { get; set; }
Property Value
RebarPoint3D
 Edit this page